proveskit/circuitpython-pico2-sleep/ports/raspberrypi/boards/spotpear_rp2040_esp32c3/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2021 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#pragma once

#define MICROPY_HW_BOARD_NAME "Spotpear RP2040 ESP32C3"
#define MICROPY_HW_MCU_NAME "rp2040"

#define MICROPY_HW_LED_STATUS (&pin_GPIO25)

#define CIRCUITPY_SAVES_PARTITION_SIZE (1 * 1024 * 1024)
